In [37]:
import pandas as pd
import numpy as np
import random

In [2]:
pd.Series([10, 20, 30, 40, 50])

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
pd.Series([10, 20, 30, 40, 50] ,index = [i for i in 'abcde'] )

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [4]:
pd.Series({'a': 1, 'b': 2, 'c': 3})

a    1
b    2
c    3
dtype: int64

In [13]:
x = pd.Series([1,2,3], index = [i for i in 'abc'])
x

a    1
b    2
c    3
dtype: int64

In [14]:
x['b']

2

In [17]:
x[1]

C:\Users\DAI.STUDENTSDC\AppData\Local\Temp\ipykernel_15400\4118936608.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  x[1]

2

In [15]:
x.loc['b']

2

In [16]:
x.iloc[1]

2

# Dataframe

In [20]:
data = {
    'Name': ['name1', 'name2', 'name3'],
    'age': [24, 54, 23],
    "city": ["city1", "city2", 'city3']
}
df = pd.DataFrame(data = data, index = None)
df

    Name  age   city
0  name1   24  city1
1  name2   54  city2
2  name3   23  city3

In [21]:
data = [
    {'Name' : 'Alice', 'Age': 25,'City': 'New York'},
    {'Name' : 'Bob', 'Age': 30, 'City': 'Los Angeles'},
    {'Name' : 'Charlie', 'Age': 44, 'City': 'Chicago'}
     ] 
df2 = pd.DataFrame(data = data, index = None)
df2

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   44      Chicago

In [23]:
names = ['name' + str(i) for i in range(1, 4)]
age = [i for i in range(45, 48)]
cities = ['city' + str(i) for i in range(1, 4)]

df3 = pd.DataFrame({
    'name': names,
    'age': age,
    'city': cities
})
df3

    name  age   city
0  name1   45  city1
1  name2   46  city2
2  name3   47  city3

In [34]:
array = np.array([[25,"New York"], [30, "Los Angeles"], [35, "Chicago"]])
df4 = pd.DataFrame(array,columns=["Age","City"])
df4.to_csv('temp_file_name.csv', index = None)
df4

  Age         City
0  25     New York
1  30  Los Angeles
2  35      Chicago

In [31]:
df5 = pd.read_csv('temp_file_name.csv')
df5

   Unnamed: 0  Age         City
0           0   25     New York
1           1   30  Los Angeles
2           2   35      Chicago

In [35]:
names = pd.Series(['name' + str(i) for i in range(1, 4)], name = 'name')
age = pd.Series([i for i in range(40, 43)], name = 'age')
city = pd.Series(['city' + str(i) for i in range(1, 4)], name = 'city')

df6 = pd.concat([names, age, city], axis = 1)
df6.to_csv('temp_file_name.csv', index = None)
df6

    name  age   city
0  name1   40  city1
1  name2   41  city2
2  name3   42  city3

# part 2

In [43]:
data = {
"rollno" : list(range(1, 11)),
"name" : ['name' + str(i) for i in range(1, 11)],
"class" : [random.choice(['class1', 'class2']) for i in range(10)],
"marks" : [random.randint(30, 40) for i in range(10)]
}

df = pd.DataFrame(data)
df.to_csv('Student_Data.csv', index = None)

In [44]:
studData = pd.read_csv("Student_Data.csv")
studData

   rollno    name   class  marks
0       1   name1  class2     32
1       2   name2  class2     31
2       3   name3  class2     35
3       4   name4  class1     35
4       5   name5  class2     38
5       6   name6  class2     32
6       7   name7  class2     39
7       8   name8  class1     31
8       9   name9  class2     39
9      10  name10  class2     37